{
  "architectures": [
    "EuroSATTransformerClassifier"
  ],
  "model_type": "swin",
  "num_labels": 10,
  "id2label": {
    "0": "AnnualCrop",
    "1": "Forest",
    "2": "HerbaceousVegetation",
    "3": "Highway",
    "4": "Industrial",
    "5": "Pasture",
    "6": "PermanentCrop",
    "7": "Residential",
    "8": "River",
    "9": "SeaLake"
  },
  "label2id": {
    "AnnualCrop": 0,
    "Forest": 1,
    "HerbaceousVegetation": 2,
    "Highway": 3,
    "Industrial": 4,
    "Pasture": 5,
    "PermanentCrop": 6,
    "Residential": 7,
    "River": 8,
    "SeaLake": 9
  },
  "base_model": "microsoft/swin-base-patch4-window7-224",
  "image_size": 224,
  "dropout_rate": 0.1,
  "problem_type": "single_label_classification"
}